app/Controllers/AuthController.php

    public function register()
    {

        $data['roles'] = $this->rolModel->findAll();
        $data['comunidades'] = $this->comunidadModel->findAll();
---
SELECT *
FROM `COMUNIDAD`

    public function do_register()
    {
        helper(['form']);

        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'Nombre' => 'required|min_length[3]|max_length[50]',
                'Correo_electronico' => 'required|valid_email|is_unique[USUARIO.Correo_electronico]',
                'Telefono' => 'required|numeric|min_length[4]',
                'Contrasena' => 'required|min_length[3]',
                'ID_Rol' => 'required|integer',
                'Direccion' => 'required',
                'ID_Comunidad' => 'required|integer'
            ];

            if ($this->validate($rules)) {
                $hasheadoContrasena = $this->request->getPost('Contrasena');

                $data = [
                    'Nombre' => $this->request->getPost('Nombre'),
                    'Correo_electronico' => $this->request->getPost('Correo_electronico'),
                    'Telefono' => $this->request->getPost('Telefono'),
                    'Contrasena' => $hasheadoContrasena,
                    'ID_Rol' => $this->request->getPost('ID_Rol'),
                    'Direccion' => $this->request->getPost('Direccion'),
                    'ID_Comunidad' => $this->request->getPost('ID_Comunidad'),
                    'Estado' => 'ACTIVO'
                ];

                if ($this->usuarioModel->insert($data)) {
---
INSERT INTO `USUARIO` (`Nombre`, `Correo_electronico`, `Telefono`, `Contrasena`, `ID_Rol`, `Direccion`, `ID_Comunidad`, `Estado`, `Fecha_registro`, `Ultima_conexion`) VALUES ('admin3', 'admin3@gmail.com', '000000000', '$2y$10$BWmf./WDjsF.8Aq9X9OiXOfRzD862C8KH6IYgsiskDrLVxltMLzkK', '2', 'xxxxx', '4', 'ACTIVO', '2024-08-27 12:40:25', '2024-08-27 12:40:25')

    public function do_login()
    {
        helper(['form']);
        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'Correo_electronico' => 'required|valid_email',
                'Contrasena' => 'required'
            ];
            if ($this->validate($rules)) {
                $correo = $this->request->getPost('Correo_electronico');
                $contrasena = $this->request->getPost('Contrasena');
                $usuario = $this->usuarioModel->where('Correo_electronico', $correo)->first();
---
SELECT *
FROM `USUARIO`
WHERE `Correo_electronico` = 'admin@mail.com'
 LIMIT 1